tutorial/turek-hron-fsi3/fluid-openfoam/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

application         pimpleFoam;       // latest OpenFOAM

startFrom           startTime;

startTime           0;

stopAt              endTime;

endTime             35;

deltaT              0.0005;

writeControl        adjustableRunTime;

writeInterval       0.1;

purgeWrite          0;

writeFormat         ascii;

writePrecision      10;

writeCompression    off;

timeFormat          general;

timePrecision       8;

runTimeModifiable   on;

functions
{
    forces
    {
        type                forces;
        libs                ( "libforces.so" );
        patches             (cylinder flap);
        rho                 rhoInf;
        log                 true;
        rhoInf              1000;
        CofR                (0 0 0);
    }

    preCICE_Adapter
    {
        type preciceAdapterFunctionObject;
        libs ("libpreciceAdapterFunctionObject.so");
    }
}
