tutorial/turek-hron-fsi3/fluid-openfoam/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |

# Author1: Nithin Adidela, IIT Goa
# email: nithin.adiela.16003@iitgoa.ac.in

# Author2: Revanth Sharma Kollegala, IIT Goa
# email: revanth.sharma.16003@iitgoa.ac.in

# Author3: Y Sudhakar, IIT Goa
# email: sudhakar@iitgoa.ac.in

# Inspired by the contribution by Derek Risseeuw (TU Delft).
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           PCG;
        preconditioner   DIC;
        tolerance        1e-5;
        relTol 	         1.0e-3;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    pcorr
    {
        $p;
    }

    pcorrFinal
    {
        $pcorr;
        relTol          0;
    }
    
    Phi
    {
        $p;
    }

    "(U|k|omega|epsilon|nuTilda|cellDisplacement)"
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        nSweeps         2;
        tolerance       1e-05;
        relTol          0.1;
    }
    
    "(U|k|omega|epsilon|nuTilda|cellDisplacement)Final"
    {
        $U;
        relTol          0;
    }

}

PIMPLE
{   
    momentumPredictor              yes;
    correctPhi                     yes;
    turbOnFinalIterOnly             no;
    nCorrectors                      1;
    nOuterCorrectors                10;
    nNonOrthogonalCorrectors         2;


    residualControl
    {
        U
        {
            relTol          0;
            tolerance       0.0001;
        }
        p
        {
            relTol          0;
            tolerance       0.0001;
        }
    }

}

potentialFlow
{
    nNonOrthogonalCorrectors 10;
}



// ************************************************************************* //